Expr#4294967040@14
  ExprKind (If)
    IfExpr#4294967040@14
      Expr#4294967040@9
        ExprKind (Literal)
          LiteralExpr#4294967040@8
            LiteralKind (True)
      Expr#4294967040@11
        ExprKind (Literal)
          LiteralExpr#4294967040@10
            LiteralKind (Integer)
              IntegerLiteral (1)
      Expr#4294967040@13
        ExprKind (Literal)
          LiteralExpr#4294967040@12
            LiteralKind (Integer)
              IntegerLiteral (2)
