[
  {
    "context": "Microsoft Corporation is an American multinational corporation and technology company headquartered in Redmond, Washington.[2] Microsoft's best-known software products are the Windows line of operating systems, the Microsoft 365 suite of productivity applications, and the Edge web browser. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. Microsoft ranked No. 14 in the 2022 Fortune 500 rankings of the largest United States corporations by total revenue;[3] and it was the world's largest software maker by revenue in 2022 according to Forbes Global 2000. It is considered one of the Big Five American information technology companies, alongside Alphabet (parent company of Google), Amazon, Apple, and Meta (parent company of Facebook).\n\nMicrosoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Windows. The company's 1986 initial public offering (IPO) and subsequent rise in its share price created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made several corporate acquisitions, the largest being the acquisition of Activision Blizzard for $68.7 billion in October 2023,[4] followed by its acquisition of LinkedIn for $26.2 billion in December 2016,[5] and its acquisition of Skype Technologies for $8.5 billion in May 2011.[6]\n\nAs of 2015, Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite market, although it has lost the majority of the overall operating system market to Android.[7] The company also produces a wide range of other consumer and enterprise software for desktops, laptops, tabs, gadgets, and servers, including Internet search (with Bing), the digital services market (through MSN), mixed reality (HoloLens), cloud computing (Azure), and software development (Visual Studio).\n\nSteve Ballmer replaced Gates as CEO in 2000 and later envisioned a 'devices and services' strategy.[8] This unfolded with Microsoft acquiring Danger Inc. in 2008,[9] entering the personal computer production market for the first time in June 2012 with the launch of the Microsoft Surface line of tablet computers, and later forming Microsoft Mobile through the acquisition of Nokia's devices and services division. Since Satya Nadella took over as CEO in 2014, the company has scaled back on hardware and instead focused on cloud computing, a move that helped the company's shares reach their highest value since December 1999.[10][11] Under Nadella's direction, the company has also heavily expanded its gaming business to support the Xbox brand, establishing the Microsoft Gaming division in 2022, dedicated to operating Xbox in addition to its three subsidiaries (publishers). Microsoft Gaming is the third-largest gaming company in the world by revenue as of 2024.[12]\n\nIn 2018, Microsoft became the most valuable publicly traded company in the world, a position it has repeatedly traded with Apple in the years since.[13] In April 2019, Microsoft reached a trillion-dollar market cap, becoming the third U.S. public company to be valued at over $1 trillion after Apple and Amazon, respectively. As of 2024, Microsoft has the third-highest global brand valuation.\n\nMicrosoft has been criticized for its monopolistic practices and the company's software has been criticized for problems with ease of use, robustness, and security.\n",
    "subjectEntity": "Microsoft Corporation",
    "facts": [
      {
        "text": "Microsoft Corporation is headquartered in Redmond, Washington."
      },
      {
        "text": "Microsoft Corporation was founded by Bill Gates.",
        "prepositionalPhrases": ["on April 4, 1975"]
      },
      {
        "text": "Microsoft Corporation was founded by Paul Allen.",
        "prepositionalPhrases": ["on April 4, 1975"]
      },
      {
        "text": "Microsoft Corporation ranked No. 14 in the Fortune 500 rankings of the largest United States corporations by total revenue.",
        "prepositionalPhrases": ["in 2022"]
      },
      {
        "text": "Microsoft Corporation is considered one of the Big Five American information technology companies."
      },
      {
        "text": "Microsoft Corporation acquired Activision Blizzard.",
        "prepositionalPhrases": ["for $68.7 billion", "in October 2023"]
      },
      {
        "text": "Microsoft Corporation acquired LinkedIn.",
        "prepositionalPhrases": ["for $26.2 billion", "in December 2016"]
      },
      {
        "text": "Microsoft Corporation acquired Skype Technologies.",
        "prepositionalPhrases": ["for $8.5 billion", "in May 2011"]
      },
      {
        "text": "Microsoft Corporation produces a wide range of consumer and enterprise software.",
        "prepositionalPhrases": [
          "for desktops, laptops, tabs, gadgets, and servers"
        ]
      }
    ]
  },
  {
    "context": "Nintendo Co., Ltd.[b] is a Japanese multinational video game company headquartered in Kyoto. It develops, publishes and releases both video games and video game consoles.  Nintendo was founded in 1889 as Nintendo Koppai[c] by craftsman Fusajiro Yamauchi and originally produced handmade hanafuda playing cards. After venturing into various lines of business during the 1960s and acquiring a legal status as a public company, Nintendo distributed its first console, the Color TV-Game, in 1977. It gained international recognition with the release of Donkey Kong in 1981 and the Nintendo Entertainment System and Super Mario Bros. in 1985. Since then, Nintendo has produced some of the most successful consoles in the video game industry, such as the Game Boy, the Super Nintendo Entertainment System, the Nintendo DS, the Wii, and the Switch. It has created and/or published numerous major franchises, including Mario, Donkey Kong, The Legend of Zelda, Metroid, Fire Emblem, Kirby, Star Fox, Pokémon, Super Smash Bros., Animal Crossing, Xenoblade Chronicles, and Splatoon, and Nintendo's mascot, Mario, is internationally recognized. The company has sold more than 5.592 billion video games and over 836 million hardware units globally, as of March 2023.Nintendo has multiple subsidiaries in Japan and abroad, in addition to business partners such as HAL Laboratory, Intelligent Systems, Game Freak, and The Pokémon Company. Nintendo and its staff have received awards including Emmy Awards for Technology & Engineering, Game Awards, Game Developers Choice Awards, and British Academy Games Awards. It is one of the wealthiest and most valuable companies in the Japanese market.",
    "subjectEntity": "Nintendo",
    "facts": [
      {
        "text": "Nintendo is a Japanese multinational video game company."
      },
      {
        "text": "Nintendo is headquartered in Kyoto."
      },
      {
        "text": "Nintendo was founded by Fusajiro Yamauchi.",
        "prepositionalPhrases": ["in 1889."]
      },
      {
        "text": "Nintendo originally produced handmade hanafuda playing cards."
      },
      {
        "text": "Nintendo distributed its first console, the Color TV-Game.",
        "prepositionalPhrases": ["in 1977."]
      },
      {
        "text": "Nintendo gained international recognition with the release of Donkey Kong.",
        "prepositionalPhrases": ["in 1981."]
      },
      {
        "text": "Nintendo released the Nintendo Entertainment System.",
        "prepositionalPhrases": ["in 1985."]
      },
      {
        "text": "Nintendo has produced successful consoles such as the Game Boy, the Super Nintendo Entertainment System, the Nintendo DS, the Wii, and the Switch."
      },
      {
        "text": "Nintendo's mascot is Mario",
        "prepositionalPhrases": []
      },
      {
        "text": "Nintendo has sold more than 5.592 billion video games globally.",
        "prepositionalPhrases": ["as of March 2023."]
      },
      {
        "text": "Nintendo has multiple subsidiaries in Japan and abroad.",
        "prepositionalPhrases": []
      }
    ]
  }
]
