---
source: libs/@local/hashql/syntax-jexpr/src/lib.rs
description: End-to-end test of parsing a complex nested expression
expression: "[\"let\",\n            {\"#literal\": \"x\"},\n            {\"#literal\": 10},\n            [\"if\",\n                [\">\", {\"#literal\": \"x\"}, {\"#literal\": 5}],\n                {\"#struct\": {\"result\": {\"#literal\": \"large\"}}},\n                {\"#struct\": {\"result\": {\"#literal\": \"small\"}}}\n            ]\n            ]"
---
Expr#4294967040@36
  ExprKind (Call)
    CallExpr#4294967040@36
      Expr#4294967040@3
        ExprKind (Path)
          Path#4294967040@3 (rooted: false)
            PathSegment#4294967040@2 (name: let)
      Argument#4294967040@5
        Expr#4294967040@5
          ExprKind (Literal)
            LiteralExpr#4294967040@4
              Primitive (String)
                String (x)
      Argument#4294967040@7
        Expr#4294967040@7
          ExprKind (Literal)
            LiteralExpr#4294967040@6
              Primitive (Integer)
                Integer (10)
      Argument#4294967040@35
        Expr#4294967040@35
          ExprKind (Call)
            CallExpr#4294967040@35
              Expr#4294967040@11
                ExprKind (Path)
                  Path#4294967040@11 (rooted: false)
                    PathSegment#4294967040@10 (name: if)
              Argument#4294967040@20
                Expr#4294967040@20
                  ExprKind (Call)
                    CallExpr#4294967040@20
                      Expr#4294967040@15
                        ExprKind (Path)
                          Path#4294967040@15 (rooted: false)
                            PathSegment#4294967040@14 (name: >)
                      Argument#4294967040@17
                        Expr#4294967040@17
                          ExprKind (Literal)
                            LiteralExpr#4294967040@16
                              Primitive (String)
                                String (x)
                      Argument#4294967040@19
                        Expr#4294967040@19
                          ExprKind (Literal)
                            LiteralExpr#4294967040@18
                              Primitive (Integer)
                                Integer (5)
              Argument#4294967040@27
                Expr#4294967040@27
                  ExprKind (Struct)
                    StructExpr#4294967040@26
                      StructEntry#4294967040@25 (key: result)
                        Expr#4294967040@24
                          ExprKind (Literal)
                            LiteralExpr#4294967040@23
                              Primitive (String)
                                String (large)
              Argument#4294967040@34
                Expr#4294967040@34
                  ExprKind (Struct)
                    StructExpr#4294967040@33
                      StructEntry#4294967040@32 (key: result)
                        Expr#4294967040@31
                          ExprKind (Literal)
                            LiteralExpr#4294967040@30
                              Primitive (String)
                                String (small)
