Expr#4294967040@23
  ExprKind (If)
    IfExpr#4294967040@23
      Expr#4294967040@5
        ExprKind (Literal)
          LiteralExpr#4294967040@4
            LiteralKind (True)
      Expr#4294967040@18
        ExprKind (Let)
          LetExpr#4294967040@18 (name: a:0)
            Expr#4294967040@15
              ExprKind (Literal)
                LiteralExpr#4294967040@14
                  LiteralKind (Integer)
                    IntegerLiteral (2)
            Expr#4294967040@17
              ExprKind (Literal)
                LiteralExpr#4294967040@16
                  LiteralKind (Integer)
                    IntegerLiteral (3)
      Expr#4294967040@22
        ExprKind (Path)
          Path#4294967040@22 (rooted: false)
            PathSegment#4294967040@21 (name: a)
